* Week 1: Python Basics: Crash Course
** Python Syntax and Basic Linux commands
1. [X] Why Python? Why python is useful
2. [X] Why Linux? What's the relationship between Linux and Python
3. [X] Don't be afraid of the terminal. Basic commands
4. [X] How to setup python
5. [X] Basic python Arithmetic and Syntax- spaces vs spaces

** Git for Data Science
1. [X] What the fuck is Git?
2. [X] Demo of using git using this repository
3. [X] Working in teams
4. [X] Work in teams as you move forward
5. [X] Real world example

** Jupyter Lab/ Jupyter Notebook for data science
1. [X] Interactivity
2. [X] Easy to visualise
3. [X] Kernels
4. [X] Advantages of learning using jupyter lab
5. [X] Don't be too dependent on Jupyter Labs/ Notebooks
6. [X] Real world example

** Basic Data Structure: Strings/ Ints
1. [X] Basic Types: Floats, Ints, Strings
2. [X] Working with Strings
3. [X] Working with Ints
4. [X] Concatanating Strings and Ints - demos casting
5. [X] Working with floats
6. [X] Real world example

#+begin_src python :results output
x = 1.2
print(3)
#+end_src

#+RESULTS:
: 3

#+CALL: prin

** Functions
1. [X] Creating a function
2. [X] The concept of abstraction in CS
3. [X] How to create a function
4. [X] Functions as first class citizens
5. [X] Real world example e.g Square, cube, quantuple, square-sum, cube-sume, quantuple-sum

** Basic Data Structure: Lists and Dicts
1. [ ] What are lists?
2. [ ] Basic list comprehensions
3. [ ] Dictionaries
4. [ ] A side note on algorithms and complexity
5. [ ] Why the fuck is this stuff important?
6. [ ] Lists vs Dictionary

** Loops
1. [ ] Naive for and while loops
2. [ ] Pythonic way for creating loops using enumerate
3. [ ] Fuck yeah. list comprehensions
4. [ ] Reals world example
   
** Organizing python code
1. [ ] Classes
2. [ ] OO vs FP- touching
3. [ ] Modules
4. [ ] Real world example

** File I/O
1. [ ] Reading to file
2. [ ] Writing to file

** Project: Web scraper
1. [ ] Scrape data from NSE

* Week 2: Data Science libraries
** Numpy
** Pandas
** Operations with Numpy and Pandas
** Other pandas 
* Week 3: Basic Data Science concepts and Analytics in Python

* Week 4: Python Best Practices

* Week 4: Projects and Analysis
